wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_syscfg.h
/*!
    \file    GD32G5x3_syscfg.h
    \brief   definitions for the SYSCFG
    
    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.
    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32G5X3_SYSCFG_H
#define GD32G5X3_SYSCFG_H

#include "gd32g5x3.h"

/* SYSCFG definitions */
#define SYSCFG                              SYSCFG_BASE                                 /*!< SYSCFG base address */

/* registers definitions */
#define SYSCFG_CFG0                         REG32(SYSCFG + 0x00000000U)                 /*!< SYSCFG configuration register 0 */
#define SYSCFG_CFG1                         REG32(SYSCFG + 0x00000004U)                 /*!< SYSCFG configuration register 1 */
#define SYSCFG_EXTISS0                      REG32(SYSCFG + 0x00000008U)                 /*!< EXTI sources selection register 0 */
#define SYSCFG_EXTISS1                      REG32(SYSCFG + 0x0000000CU)                 /*!< EXTI sources selection register 1 */
#define SYSCFG_EXTISS2                      REG32(SYSCFG + 0x00000010U)                 /*!< EXTI sources selection register 2 */
#define SYSCFG_EXTISS3                      REG32(SYSCFG + 0x00000014U)                 /*!< EXTI sources selection register 3 */
#define SYSCFG_CFG2                         REG32(SYSCFG + 0x00000018U)                 /*!< SYSCFG configuration register 2 */
#define SYSCFG_STAT                         REG32(SYSCFG + 0x0000001CU)                 /*!< SYSCFG status register */
#define SYSCFG_CFG3                         REG32(SYSCFG + 0x00000020U)                 /*!< SYSCFG configuration register 3 */
#define SYSCFG_CFG4                         REG32(SYSCFG + 0x00000024U)                 /*!< SYSCFG configuration register 4 */
#define SYSCFG_CFG5                         REG32(SYSCFG + 0x00000028U)                 /*!< SYSCFG configuration register 5 */
#define SYSCFG_TCMSRAMCS                    REG32(SYSCFG + 0x00000030U)                 /*!< SYSCFG TCMSRAM control and status register */
#define SYSCFG_TCMSRAMKEY                   REG32(SYSCFG + 0x00000034U)                 /*!< SYSCFG TCMSRAM key register */
#define SYSCFG_TCMSRAMWP                    REG32(SYSCFG + 0x00000038U)                 /*!< SYSCFG TCMSRAM write protection register */
#define SYSCFG_CPSCTL                       REG32(SYSCFG + 0x0000003CU)                 /*!< SYSCFG I/O Compensation cell control/status register */
#define SYSCFG_TIMERCISEL0                  REG32(SYSCFG + 0x00000044U)                 /*!< SYSCFG TIMER input selection register 0 */
#define SYSCFG_TIMERCISEL1                  REG32(SYSCFG + 0x00000048U)                 /*!< SYSCFG TIMER input selection register 1 */
#define SYSCFG_TIMERCISEL2                  REG32(SYSCFG + 0x0000004CU)                 /*!< SYSCFG TIMER input selection register 2 */
#define SYSCFG_TIMERCISEL3                  REG32(SYSCFG + 0x00000050U)                 /*!< SYSCFG TIMER input selection register 3 */
#define SYSCFG_TIMERCISEL4                  REG32(SYSCFG + 0x00000054U)                 /*!< SYSCFG TIMER input selection register 4 */

/* SYSCFG_CFG0 bits definitions */
#define SYSCFG_CFG0_BOOT_MODE               BITS(0,2)                                   /*!< Boot mode selection */
#define SYSCFG_CFG0_FMC_SWP                 BIT(8)                                      /*!< FMC memory mapping swap */

/* SYSCFG_CFG1 bits definitions */
#define SYSCFG_CFG1_PB6FMPEN                BIT(16)                                     /*!< I2C Fm+ mode on PB6 pin enable */
#define SYSCFG_CFG1_PB7FMPEN                BIT(17)                                     /*!< I2C Fm+ mode on PB7 pin enable */
#define SYSCFG_CFG1_PB8FMPEN                BIT(18)                                     /*!< I2C Fm+ mode on PB8 pin enable */
#define SYSCFG_CFG1_PB9FMPEN                BIT(19)                                     /*!< I2C Fm+ mode on PB9 pin enable */
#define SYSCFG_CFG1_I2C0FMPEN               BIT(20)                                     /*!< I2C0 fast mode plus enable */
#define SYSCFG_CFG1_I2C1FMPEN               BIT(21)                                     /*!< I2C1 fast mode plus enable */
#define SYSCFG_CFG1_I2C2FMPEN               BIT(22)                                     /*!< I2C2 fast mode plus enable */
#define SYSCFG_CFG1_I2C3FMPEN               BIT(23)                                     /*!< I2C3 fast mode plus enable */
#define SYSCFG_CFG1_FPUINTEN_IOPIE          BIT(26)                                     /*!< Invalid operation interrupt enable */
#define SYSCFG_CFG1_FPUINTEN_DZIE           BIT(27)                                     /*!< Divide-by-zero interrupt enable */
#define SYSCFG_CFG1_FPUINTEN_UFIE           BIT(28)                                     /*!< Underflow interrupt enable */
#define SYSCFG_CFG1_FPUINTEN_OVFIE          BIT(29)                                     /*!< Overflow interrupt enable */
#define SYSCFG_CFG1_FPUINTEN_IDIE           BIT(30)                                     /*!< Input abnormal interrupt enable */
#define SYSCFG_CFG1_FPUINTEN_IXIE           BIT(31)                                     /*!< Inexact interrupt enable */

