wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_syscfg.h
/* SYSCFG_EXTISS0 bits definitions */
#define SYSCFG_EXTISS0_EXTI0_SS             BITS(0,3)                                   /*!< EXTI 0 configuration */
#define SYSCFG_EXTISS0_EXTI1_SS             BITS(4,7)                                   /*!< EXTI 1 configuration */
#define SYSCFG_EXTISS0_EXTI2_SS             BITS(8,11)                                  /*!< EXTI 2 configuration */
#define SYSCFG_EXTISS0_EXTI3_SS             BITS(12,15)                                 /*!< EXTI 3 configuration */

/* SYSCFG_EXTISS1 bits definitions */
#define SYSCFG_EXTISS1_EXTI4_SS             BITS(0,3)                                   /*!< EXTI 4 configuration */
#define SYSCFG_EXTISS1_EXTI5_SS             BITS(4,7)                                   /*!< EXTI 5 configuration */
#define SYSCFG_EXTISS1_EXTI6_SS             BITS(8,11)                                  /*!< EXTI 6 configuration */
#define SYSCFG_EXTISS1_EXTI7_SS             BITS(12,15)                                 /*!< EXTI 7 configuration */

/* SYSCFG_EXTISS2 bits definitions */
#define SYSCFG_EXTISS2_EXTI8_SS             BITS(0,3)                                   /*!< EXTI 8 configuration */
#define SYSCFG_EXTISS2_EXTI9_SS             BITS(4,7)                                   /*!< EXTI 9 configuration */
#define SYSCFG_EXTISS2_EXTI10_SS            BITS(8,11)                                  /*!< EXTI 10 configuration */
#define SYSCFG_EXTISS2_EXTI11_SS            BITS(12,15)                                 /*!< EXTI 11 configuration */

/* SYSCFG_EXTISS3 bits definitions */
#define SYSCFG_EXTISS3_EXTI12_SS            BITS(0,3)                                   /*!< EXTI 12 configuration */
#define SYSCFG_EXTISS3_EXTI13_SS            BITS(4,7)                                   /*!< EXTI 13 configuration */
#define SYSCFG_EXTISS3_EXTI14_SS            BITS(8,11)                                  /*!< EXTI 14 configuration */
#define SYSCFG_EXTISS3_EXTI15_SS            BITS(12,15)                                 /*!< EXTI 15 configuration */

/* SYSCFG_CFG2 bits definitions */
#define SYSCFG_CFG2_LOCKUP_LOCK             BIT(0)                                      /*!< CPU lockup (Hardfault) output enable */
#define SYSCFG_CFG2_SRAM0_ECC_LOCK          BIT(1)                                      /*!< SRAM0 ECC lockup enable */
#define SYSCFG_CFG2_LVD_LOCK                BIT(2)                                      /*!< Programmable voltage detector lockup enable */
#define SYSCFG_CFG2_FLASH_ECC_LOCK          BIT(3)                                      /*!< Flash ECC lockup enable */
#define SYSCFG_CFG2_SRAM1_ECC_LOCK          BIT(4)                                      /*!< SRAM1 ECC lockup enable */
#define SYSCFG_CFG2_TCMSRAM_ECC_LOCK        BIT(5)                                      /*!< TCMSRAM ECC lockup enable */
#define SYSCFG_CFG2_PIN_RSTMD               BIT(24)                                     /*!< Pin reset mode enable */
#define SYSCFG_CFG2_TRGSEL_RSTMD            BIT(25)                                     /*!< Trigsel reset mode enable */

/* SYSCFG_STAT bits definitions */
#define SYSCFG_STAT_SRAM0ECCMEIF            BIT(0)                                      /*!< SRAM0 multi-bits non-correction event flag */
#define SYSCFG_STAT_SRAM0ECCSEIF            BIT(1)                                      /*!< SRAM0 single bit correction event flag */
#define SYSCFG_STAT_FLASHECCIF              BIT(2)                                      /*!< Flash ECC NMI interrupt flag */
#define SYSCFG_STAT_CKMNMIIF                BIT(3)                                      /*!< HXTAL clock moniotor NMI interrupt flag */
#define SYSCFG_STAT_NMIPINIF                BIT(4)                                      /*!< Interrupt flag from NMI pin */
#define SYSCFG_STAT_SRAM1ECCMEIF            BIT(5)                                      /*!< SRAM1 multi-bits non-correction event flag */
#define SYSCFG_STAT_SRAM1ECCSEIF            BIT(6)                                      /*!< SRAM1 single bit correction event flag */
#define SYSCFG_STAT_TCMSRAMECCMEIF          BIT(7)                                      /*!< TCMSRAM multi-bits non-correction event flag */
#define SYSCFG_STAT_TCMSRAMECCSEIF          BIT(8)                                      /*!< TCMSRAM single bit correction event flag */

/* SYSCFG_CFG3 bits definitions */
#define SYSCFG_CFG3_SRAM0ECCMEIE            BIT(0)                                      /*!< SRAM0 multi-bits non-correction event enable */
#define SYSCFG_CFG3_SRAM0ECCSEIE            BIT(1)                                      /*!< SRAM0 single bit correction event enable */
#define SYSCFG_CFG3_FLASHECCIE              BIT(2)                                      /*!< Flash ECC NMI interrupt enable */
#define SYSCFG_CFG3_CKMNMIIE                BIT(3)                                      /*!< HXTAL clock moniotor NMI interrupt enable */
#define SYSCFG_CFG3_NMIPINIE                BIT(4)                                      /*!< Interrupt flag from NMI pin interrupt enable */
#define SYSCFG_CFG3_SRAM0ECCSERRBITS        BITS(10,15)                                 /*!< Which one bit has an SRAM0 ECC single-bit correctable error */
#define SYSCFG_CFG3_SRAM0ECCEADDR           BITS(17,31)                                 /*!< Faulting system address where the last SRAM0 ECC event on SRAM occurred */

/* SYSCFG_CFG4 bits definitions */
#define SYSCFG_CFG4_SRAM1ECCMEIE            BIT(0)                                      /*!< SRAM1 multi-bits non-correction event enable */
#define SYSCFG_CFG4_SRAM1ECCSEIE            BIT(1)                                      /*!< SRAM1 single bit correction event enable */
#define SYSCFG_CFG4_SRAM1ECCSERRBITS        BITS(10,15)                                 /*!< Which one bit has an SRAM1 ECC single-bit correctable error */
#define SYSCFG_CFG4_SRAM1ECCEADDR           BITS(20,31)                                 /*!< Faulting system address where the last SRAM1 ECC event on SRAM occurred */

/* SYSCFG_CFG5 bits definitions */
#define SYSCFG_CFG5_TCMSRAMECCMEIE          BIT(0)                                      /*!< TCMSRAM multi-bits non-correction event enable */
#define SYSCFG_CFG5_TCMSRAMECCSEIE          BIT(1)                                      /*!< TCMSRAM single bit correction event enable */
#define SYSCFG_CFG5_TCMSRAMECCSERRBITS      BITS(10,15)                                 /*!< TCMSRAM ECC single-bit correctable error bit number */
#define SYSCFG_CFG5_TCMSRAMECCEADDR         BITS(19,31)                                 /*!< Faulting system address where the last TCMSRAM ECC event on SRAM occurred */

/* SYSCFG_TCMSRAMCS bits definitions */
#define SYSCFG_TCMSRAMCS_TCMSRAMER          BIT(0)                                      /*!< TCMSRAM erase */
#define SYSCFG_TCMSRAMCS_TCMSRAMBSY         BIT(1)                                      /*!< TCMSRAM busy flag by erase operation */

