wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_syscfg.h
/* SYSCFG_TCMSRAMKEY bits definition */
#define SYSCFG_TCMSRAMKEY_WP_KEY            BITS(0,7)                                   /*!< TCMSRAM write protection key */

/* SYSCFG_TCMSRAMWP bits definitions */
#define SYSCFG_TCMSRAMWP_P0WPEN             BIT(0)                                      /*!< TCMSRAM page 0 write protection enable */
#define SYSCFG_TCMSRAMWP_P1WPEN             BIT(1)                                      /*!< TCMSRAM page 1 write protection enable */
#define SYSCFG_TCMSRAMWP_P2WPEN             BIT(2)                                      /*!< TCMSRAM page 2 write protection enable */
#define SYSCFG_TCMSRAMWP_P3WPEN             BIT(3)                                      /*!< TCMSRAM page 3 write protection enable */
#define SYSCFG_TCMSRAMWP_P4WPEN             BIT(4)                                      /*!< TCMSRAM page 4 write protection enable */
#define SYSCFG_TCMSRAMWP_P5WPEN             BIT(5)                                      /*!< TCMSRAM page 5 write protection enable */
#define SYSCFG_TCMSRAMWP_P6WPEN             BIT(6)                                      /*!< TCMSRAM page 6 write protection enable */
#define SYSCFG_TCMSRAMWP_P7WPEN             BIT(7)                                      /*!< TCMSRAM page 7 write protection enable */
#define SYSCFG_TCMSRAMWP_P8WPEN             BIT(8)                                      /*!< TCMSRAM page 8 write protection enable */
#define SYSCFG_TCMSRAMWP_P9WPEN             BIT(9)                                      /*!< TCMSRAM page 9 write protection enable */
#define SYSCFG_TCMSRAMWP_P10WPEN            BIT(10)                                     /*!< TCMSRAM page 10 write protection enable */
#define SYSCFG_TCMSRAMWP_P11WPEN            BIT(11)                                     /*!< TCMSRAM page 11 write protection enable */
#define SYSCFG_TCMSRAMWP_P12WPEN            BIT(12)                                     /*!< TCMSRAM page 12 write protection enable */
#define SYSCFG_TCMSRAMWP_P13WPEN            BIT(13)                                     /*!< TCMSRAM page 13 write protection enable */
#define SYSCFG_TCMSRAMWP_P14WPEN            BIT(14)                                     /*!< TCMSRAM page 14 write protection enable */
#define SYSCFG_TCMSRAMWP_P15WPEN            BIT(15)                                     /*!< TCMSRAM page 15 write protection enable */
#define SYSCFG_TCMSRAMWP_P16WPEN            BIT(16)                                     /*!< TCMSRAM page 16 write protection enable */
#define SYSCFG_TCMSRAMWP_P17WPEN            BIT(17)                                     /*!< TCMSRAM page 17 write protection enable */
#define SYSCFG_TCMSRAMWP_P18WPEN            BIT(18)                                     /*!< TCMSRAM page 18 write protection enable */
#define SYSCFG_TCMSRAMWP_P19WPEN            BIT(19)                                     /*!< TCMSRAM page 19 write protection enable */
#define SYSCFG_TCMSRAMWP_P20WPEN            BIT(20)                                     /*!< TCMSRAM page 20 write protection enable */
#define SYSCFG_TCMSRAMWP_P21WPEN            BIT(21)                                     /*!< TCMSRAM page 21 write protection enable */
#define SYSCFG_TCMSRAMWP_P22WPEN            BIT(22)                                     /*!< TCMSRAM page 22 write protection enable */
#define SYSCFG_TCMSRAMWP_P23WPEN            BIT(23)                                     /*!< TCMSRAM page 23 write protection enable */
#define SYSCFG_TCMSRAMWP_P24WPEN            BIT(24)                                     /*!< TCMSRAM page 24 write protection enable */
#define SYSCFG_TCMSRAMWP_P25WPEN            BIT(25)                                     /*!< TCMSRAM page 25 write protection enable */
#define SYSCFG_TCMSRAMWP_P26WPEN            BIT(26)                                     /*!< TCMSRAM page 26 write protection enable */
#define SYSCFG_TCMSRAMWP_P27WPEN            BIT(27)                                     /*!< TCMSRAM page 27 write protection enable */
#define SYSCFG_TCMSRAMWP_P28WPEN            BIT(28)                                     /*!< TCMSRAM page 28 write protection enable */
#define SYSCFG_TCMSRAMWP_P29WPEN            BIT(29)                                     /*!< TCMSRAM page 29 write protection enable */
#define SYSCFG_TCMSRAMWP_P30WPEN            BIT(30)                                     /*!< TCMSRAM page 30 write protection enable */
#define SYSCFG_TCMSRAMWP_P31WPEN            BIT(31)                                     /*!< TCMSRAM page 31 write protection enable */

/* SYSCFG_CPSCTL bits definitions */
#define SYSCFG_CPSCTL_CPS_EN                BIT(0)                                      /*!< I/O compensation cell enable */
#define SYSCFG_CPSCTL_CPS_RDY               BIT(8)                                      /*!< Compensation cell ready flag */

/* SYSCFG_TIMERCISEL0 bits definitions */
#define SYSCFG_TIMER7_CI0_SEL               BITS(0,3)                                   /*!< selects TIMER7_CI0 input */
#define SYSCFG_TIMER7_CI1_SEL               BITS(4,7)                                   /*!< selects TIMER7_CI1 input */
#define SYSCFG_TIMER7_CI2_SEL               BITS(8,11)                                  /*!< selects TIMER7_CI2 input */
#define SYSCFG_TIMER7_CI3_SEL               BITS(12,15)                                 /*!< selects TIMER7_CI3 input */
#define SYSCFG_TIMER0_CI0_SEL               BITS(16,19)                                 /*!< selects TIMER0_CI0 input */
#define SYSCFG_TIMER0_CI1_SEL               BITS(20,23)                                 /*!< selects TIMER0_CI1 input */
#define SYSCFG_TIMER0_CI2_SEL               BITS(24,27)                                 /*!< selects TIMER0_CI2 input */
#define SYSCFG_TIMER0_CI3_SEL               BITS(28,31)                                 /*!< selects TIMER0_CI3 input */

/* SYSCFG_TIMERCISEL1 bits definitions */
#define SYSCFG_TIMER19_CI0_SEL              BITS(0,3)                                   /*!< selects TIMER19_CI0 input */
#define SYSCFG_TIMER19_CI1_SEL              BITS(4,7)                                   /*!< selects TIMER19_CI1 input */
#define SYSCFG_TIMER19_CI2_SEL              BITS(8,11)                                  /*!< selects TIMER19_CI2 input */
#define SYSCFG_TIMER19_CI3_SEL              BITS(12,15)                                 /*!< selects TIMER19_CI3 input */

/* SYSCFG_TIMERCISEL2 bits definitions */
#define SYSCFG_TIMER2_CI0_SEL               BITS(0,3)                                   /*!< selects TIMER2_CI0 input */
#define SYSCFG_TIMER2_CI1_SEL               BITS(4,7)                                   /*!< selects TIMER2_CI1 input */
#define SYSCFG_TIMER2_CI2_SEL               BITS(8,11)                                  /*!< selects TIMER2_CI2 input */
#define SYSCFG_TIMER2_CI3_SEL               BITS(12,15)                                 /*!< selects TIMER2_CI3 input */
#define SYSCFG_TIMER1_CI0_SEL               BITS(16,19)                                 /*!< selects TIMER1_CI0 input */
#define SYSCFG_TIMER1_CI1_SEL               BITS(20,23)                                 /*!< selects TIMER1_CI1 input */
#define SYSCFG_TIMER1_CI2_SEL               BITS(24,27)                                 /*!< selects TIMER1_CI2 input */
#define SYSCFG_TIMER1_CI3_SEL               BITS(28,31)                                 /*!< selects TIMER1_CI3 input */

/* SYSCFG_TIMERCISEL3 bits definitions */
#define SYSCFG_TIMER4_CI0_SEL               BITS(0,3)                                   /*!< selects TIMER4_CI0 input */
#define SYSCFG_TIMER4_CI1_SEL               BITS(4,7)                                   /*!< selects TIMER4_CI1 input */
#define SYSCFG_TIMER4_CI2_SEL               BITS(8,11)                                  /*!< selects TIMER4_CI2 input */
#define SYSCFG_TIMER4_CI3_SEL               BITS(12,15)                                 /*!< selects TIMER4_CI3 input */
#define SYSCFG_TIMER3_CI0_SEL               BITS(16,19)                                 /*!< selects TIMER3_CI0 input */
#define SYSCFG_TIMER3_CI1_SEL               BITS(20,23)                                 /*!< selects TIMER3_CI1 input */
#define SYSCFG_TIMER3_CI2_SEL               BITS(24,27)                                 /*!< selects TIMER3_CI2 input */
#define SYSCFG_TIMER3_CI3_SEL               BITS(28,31)                                 /*!< selects TIMER3_CI3 input */

/* SYSCFG_TIMERCISEL4 bits definitions */
#define SYSCFG_TIMER14_CI0_SEL              BITS(0,3)                                   /*!< selects TIMER14_CI0 input */
#define SYSCFG_TIMER14_CI1_SEL              BITS(4,7)                                   /*!< selects TIMER14_CI1 input */
#define SYSCFG_TIMER15_CI0_SEL              BITS(8,11)                                  /*!< selects TIMER15_CI0 input */
#define SYSCFG_TIMER16_CI0_SEL              BITS(12,15)                                 /*!< selects TIMER16_CI0 input */

/* TIMER trigger selection register */
#define SYSCFG_TIMERCFG_TSCFG0              BITS(0,4)                                   /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG1              BITS(5,9)                                   /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG2              BITS(10,14)                                 /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG3              BITS(16,20)                                 /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG4              BITS(21,25)                                 /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG5              BITS(26,30)                                 /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG6              BITS(0,4)                                   /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG7              BITS(5,9)                                   /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG8              BITS(10,14)                                 /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG9              BITS(16,20)                                 /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG10             BITS(21,25)                                 /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG11             BITS(26,30)                                 /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG12             BITS(0,4)                                   /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG13             BITS(5,9)                                   /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG14             BITS(10,14)                                 /*!< TIMER trigger selection */

/* constants definitions */
/* Flash bank mode definitions */
#define SYSCFG_FLASH_BANK0_MAPPED           ((uint8_t)0x00U)                            /*!< Flash Bank 1 mapped at 0x08000000,and Flash Bank 0 mapped at 0x08040000(depend on the specific series of bank size) */
#define SYSCFG_FLASH_BANK1_MAPPED           SYSCFG_CFG0_FMC_SWP                         /*!< Flash Bank 0 mapped at 0x08000000,and Flash Bank 1 mapped at 0x08040000(depend on the specific series of bank size) */

