wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_syscfg.h
/* Memory mapping bootmode definitions */
#define SYSCFG_MAIN_FLASH_MEMORY            ((uint8_t)0x00U)                            /*!< Main Flash memory mapped at 0x00000000 */
#define SYSCFG_SYSTEM_FLASH_MEMORY          ((uint8_t)0x01U)                            /*!< SYSCFG Flash memory mapped at 0x00000000 */
#define SYSCFG_EXMC_MEMORY                  ((uint8_t)0x02U)                            /*!< EXMC memory mapped at 0x00000000 */
#define SYSCFG_SRAM0_MEMORY                 ((uint8_t)0x03U)                            /*!< SRAM0 mapped at 0x00000000 */
#define SYSCFG_QSPI_MEMORY                  ((uint8_t)0x04U)                            /*!< QSPI memory mapped at 0x00000000 */

/* Floating point unit interrupts enable definitions */
#define SYSCFG_FPUINT_INEXACT               SYSCFG_CFG1_FPUINTEN_IXIE                   /*!< Inexact interrupt */
#define SYSCFG_FPUINT_INPUT_ABNORMAL        SYSCFG_CFG1_FPUINTEN_IDIE                   /*!< Input abnormal interrupt */
#define SYSCFG_FPUINT_OVERFLOW              SYSCFG_CFG1_FPUINTEN_OVFIE                  /*!< Overflow interrupt */
#define SYSCFG_FPUINT_UNDERFLOW             SYSCFG_CFG1_FPUINTEN_UFIE                   /*!< Underflow interrupt */
#define SYSCFG_FPUINT_DIV0                  SYSCFG_CFG1_FPUINTEN_DZIE                   /*!< Divide-by-zero interrupt */
#define SYSCFG_FPUINT_INVALID_OPERATION     SYSCFG_CFG1_FPUINTEN_IOPIE                  /*!< Invalid operation interrupt */

/* I2Cx fast mode plus enable definitions */
#define SYSCFG_I2C0_FMP                     SYSCFG_CFG1_I2C0FMPEN                       /*!< I2C0 fast mode plus enable */
#define SYSCFG_I2C1_FMP                     SYSCFG_CFG1_I2C1FMPEN                       /*!< I2C1 fast mode plus enable */
#define SYSCFG_I2C2_FMP                     SYSCFG_CFG1_I2C2FMPEN                       /*!< I2C2 fast mode plus enable */
#define SYSCFG_I2C3_FMP                     SYSCFG_CFG1_I2C3FMPEN                       /*!< I2C3 fast mode plus enable */

/* pin high current capability definitions */
#define SYSCFG_I2C_FMP_PB6                  SYSCFG_CFG1_PB6FMPEN                        /*!< I2C Fm+ mode on PB6 pin enable */
#define SYSCFG_I2C_FMP_PB7                  SYSCFG_CFG1_PB7FMPEN                        /*!< I2C Fm+ mode on PB7 pin enable */
#define SYSCFG_I2C_FMP_PB8                  SYSCFG_CFG1_PB8FMPEN                        /*!< I2C Fm+ mode on PB8 pin enable */
#define SYSCFG_I2C_FMP_PB9                  SYSCFG_CFG1_PB9FMPEN                        /*!< I2C Fm+ mode on PB9 pin enable */

/* EXTI source select definitions */
#define EXTISS0                             ((uint8_t)0x00U)                            /*!< EXTI source select register 0 */
#define EXTISS1                             ((uint8_t)0x01U)                            /*!< EXTI source select register 1 */
#define EXTISS2                             ((uint8_t)0x02U)                            /*!< EXTI source select register 2 */
#define EXTISS3                             ((uint8_t)0x03U)                            /*!< EXTI source select register 3 */

/* EXTI source select mask bits definition */
#define EXTI_SS_MASK                        BITS(0,3)                                   /*!< EXTI source select mask */

/* EXTI source select jumping step definition */
#define EXTI_SS_JSTEP                       ((uint8_t)(0x04U))                          /*!< EXTI source select jumping step */

/* EXTI source select moving step definition */
#define EXTI_SS_MSTEP(pin)                  (EXTI_SS_JSTEP * ((pin) % EXTI_SS_JSTEP))   /*!< EXTI source select moving step */

/* EXTI source port definitions */
#define EXTI_SOURCE_GPIOA                   ((uint8_t)0x00U)                            /*!< EXTI GPIOA configuration */
#define EXTI_SOURCE_GPIOB                   ((uint8_t)0x01U)                            /*!< EXTI GPIOB configuration */
#define EXTI_SOURCE_GPIOC                   ((uint8_t)0x02U)                            /*!< EXTI GPIOC configuration */
#define EXTI_SOURCE_GPIOD                   ((uint8_t)0x03U)                            /*!< EXTI GPIOD configuration */
#define EXTI_SOURCE_GPIOE                   ((uint8_t)0x04U)                            /*!< EXTI GPIOE configuration */
#define EXTI_SOURCE_GPIOF                   ((uint8_t)0x05U)                            /*!< EXTI GPIOF configuration */
#define EXTI_SOURCE_GPIOG                   ((uint8_t)0x06U)                            /*!< EXTI GPIOG configuration */

/* EXTI source pin definitions */
#define EXTI_SOURCE_PIN0                    ((uint8_t)0x00U)                            /*!< EXTI GPIO pin0 configuration */
#define EXTI_SOURCE_PIN1                    ((uint8_t)0x01U)                            /*!< EXTI GPIO pin1 configuration */
#define EXTI_SOURCE_PIN2                    ((uint8_t)0x02U)                            /*!< EXTI GPIO pin2 configuration */
#define EXTI_SOURCE_PIN3                    ((uint8_t)0x03U)                            /*!< EXTI GPIO pin3 configuration */
#define EXTI_SOURCE_PIN4                    ((uint8_t)0x04U)                            /*!< EXTI GPIO pin4 configuration */
#define EXTI_SOURCE_PIN5                    ((uint8_t)0x05U)                            /*!< EXTI GPIO pin5 configuration */
#define EXTI_SOURCE_PIN6                    ((uint8_t)0x06U)                            /*!< EXTI GPIO pin6 configuration */
#define EXTI_SOURCE_PIN7                    ((uint8_t)0x07U)                            /*!< EXTI GPIO pin7 configuration */
#define EXTI_SOURCE_PIN8                    ((uint8_t)0x08U)                            /*!< EXTI GPIO pin8 configuration */
#define EXTI_SOURCE_PIN9                    ((uint8_t)0x09U)                            /*!< EXTI GPIO pin9 configuration */
#define EXTI_SOURCE_PIN10                   ((uint8_t)0x0AU)                            /*!< EXTI GPIO pin10 configuration */
#define EXTI_SOURCE_PIN11                   ((uint8_t)0x0BU)                            /*!< EXTI GPIO pin11 configuration */
#define EXTI_SOURCE_PIN12                   ((uint8_t)0x0CU)                            /*!< EXTI GPIO pin12 configuration */
#define EXTI_SOURCE_PIN13                   ((uint8_t)0x0DU)                            /*!< EXTI GPIO pin13 configuration */
#define EXTI_SOURCE_PIN14                   ((uint8_t)0x0EU)                            /*!< EXTI GPIO pin14 configuration */
#define EXTI_SOURCE_PIN15                   ((uint8_t)0x0FU)                            /*!< EXTI GPIO pin15 configuration */

