wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_syscfg.h
/* pin reset mode definitions */
#define SYSCFG_PIN_NRST                     SYSCFG_CFG2_PIN_RSTMD                       /*!< GPIO pin configuration will retain state across any reset event except for the POR event */
#define SYSCFG_PIN_RST                      ((uint32_t)0x00000000U)                     /*!< GPIO pin configuration is reset when any reset event occurs */

/* Trigsel cla reset mode definitions */
#define SYSCFG_TRGSEL_CLA_NRST              SYSCFG_CFG2_TRGSEL_RSTMD                    /*!< Trigsel CLA configuration will retain state across any reset event except for the POR event */
#define SYSCFG_TRGSEL_CLA_RST               ((uint32_t)0x00000000U)                     /*!< Trigsel CLA configuration is reset when any reset event occurs */

/* define the peripheral interrupt enable bit position and its register index offset */
#define SYSCFG_REGIDX_BIT(regidx, bitpos)   (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define SYSCFG_REG_VAL(interrupt)           (REG32(SYSCFG + ((uint32_t)(interrupt) >> 6)))
#define SYSCFG_BIT_POS(val)                 ((uint32_t)(val) & 0x0000001FU)

/* register offset */
#define SYSCFG_STATUS_REG_OFFSET            ((uint32_t)0x0000001CU)                     /*!< SYSCFG status register offset */
#define SYSCFG_CFG3_REG_OFFSET              ((uint32_t)0x00000020U)                     /*!< SYSCFG CFG2 register offset */
#define SYSCFG_CFG4_REG_OFFSET              ((uint32_t)0x00000024U)                     /*!< SYSCFG CFG3 register offset */
#define SYSCFG_CFG5_REG_OFFSET              ((uint32_t)0x00000028U)                     /*!< SYSCFG CFG4 register offset */

/* peripheral interrupt */
typedef enum
{
    /* SYSCFG3 interrupt */
    SYSCFG_INT_SRAM0ECCME         = SYSCFG_REGIDX_BIT(SYSCFG_CFG3_REG_OFFSET, 0U),      /*!< SRAM0 ECC multi-bits non-correction event */
    SYSCFG_INT_SRAM0ECCSE         = SYSCFG_REGIDX_BIT(SYSCFG_CFG3_REG_OFFSET, 1U),      /*!< SRAM0 ECC single bit correction event */
    SYSCFG_INT_FLASHECC           = SYSCFG_REGIDX_BIT(SYSCFG_CFG3_REG_OFFSET, 2U),      /*!< Flash ECC NMI interrupt */
    SYSCFG_INT_CKMNMI             = SYSCFG_REGIDX_BIT(SYSCFG_CFG3_REG_OFFSET, 3U),      /*!< HXTAL clock moniotor NMI interrupt */
    SYSCFG_INT_NMIPIN             = SYSCFG_REGIDX_BIT(SYSCFG_CFG3_REG_OFFSET, 4U),      /*!< NMI pin interrupt */
    /* SYSCFG4 interrupt */
    SYSCFG_INT_SRAM1ECCME         = SYSCFG_REGIDX_BIT(SYSCFG_CFG4_REG_OFFSET, 0U),      /*!< SRAM1 ECC multi-bits non-correction event */
    SYSCFG_INT_SRAM1ECCSE         = SYSCFG_REGIDX_BIT(SYSCFG_CFG4_REG_OFFSET, 1U),      /*!< SRAM1 ECC single bit correction event */
    /* SYSCFG5 interrupt */
    SYSCFG_INT_TCMSRAMECCME       = SYSCFG_REGIDX_BIT(SYSCFG_CFG5_REG_OFFSET, 0U),      /*!< TCMSRAM ECC multi-bits non-correction event */
    SYSCFG_INT_TCMSRAMECCSE       = SYSCFG_REGIDX_BIT(SYSCFG_CFG5_REG_OFFSET, 1U)       /*!< TCMSRAM ECC single bit correction event */
}syscfg_interrupt_enum;

/* peripheral interrupt flag */
typedef enum
{
    SYSCFG_INT_FLAG_SRAM0ECCME    = SYSCFG_REGIDX_BIT(SYSCFG_STATUS_REG_OFFSET, 0U),    /*!< SRAM0 ECC multi-bits non-correction event flag */
    SYSCFG_INT_FLAG_SRAM0ECCSE    = SYSCFG_REGIDX_BIT(SYSCFG_STATUS_REG_OFFSET, 1U),    /*!< SRAM0 ECC single bit correction event flag */
    SYSCFG_INT_FLAG_FLASHECC      = SYSCFG_REGIDX_BIT(SYSCFG_STATUS_REG_OFFSET, 2U),    /*!< Flash ECC NMI interrupt flag */
    SYSCFG_INT_FLAG_CKMNMI        = SYSCFG_REGIDX_BIT(SYSCFG_STATUS_REG_OFFSET, 3U),    /*!< HXTAL clock moniotor NMI interrupt flag */
    SYSCFG_INT_FLAG_NMIPIN        = SYSCFG_REGIDX_BIT(SYSCFG_STATUS_REG_OFFSET, 4U),    /*!< NMI pin interrupt flag */
    SYSCFG_INT_FLAG_SRAM1ECCME    = SYSCFG_REGIDX_BIT(SYSCFG_STATUS_REG_OFFSET, 5U),    /*!< SRAM1 ECC multi-bits non-correction event flag */
    SYSCFG_INT_FLAG_SRAM1ECCSE    = SYSCFG_REGIDX_BIT(SYSCFG_STATUS_REG_OFFSET, 6U),    /*!< SRAM1 ECC single bit correction event flag */
    SYSCFG_INT_FLAG_TCMSRAMECCME  = SYSCFG_REGIDX_BIT(SYSCFG_STATUS_REG_OFFSET, 7U),    /*!< TCMSRAM ECC multi-bits non-correction event flag */
    SYSCFG_INT_FLAG_TCMSRAMECCSE  = SYSCFG_REGIDX_BIT(SYSCFG_STATUS_REG_OFFSET, 8U)     /*!< TCMSRAM ECC single bit correction event flag */
}syscfg_flag_enum;

/* SRAM ECC single-bit correctable error bit */
typedef enum
{
    SYSCFG_SRAM0_SERRBITS         = SYSCFG_REGIDX_BIT(SYSCFG_CFG3_REG_OFFSET, 10U),     /*!< SRAM0 ECC single-bit correctable error bit */
    SYSCFG_SRAM1_SERRBITS         = SYSCFG_REGIDX_BIT(SYSCFG_CFG4_REG_OFFSET, 10U),     /*!< SRAM1 ECC single-bit correctable error bit */
    SYSCFG_TCMSRAM_SERRBITS       = SYSCFG_REGIDX_BIT(SYSCFG_CFG5_REG_OFFSET, 10U)      /*!< TCMSRAM ECC single-bit correctable error bit */
}syscfg_sram_serrbits_enum;

/* last SRAM ECC error address */
typedef enum
{
    SYSCFG_SRAM0_ERR_ADDR         = SYSCFG_REGIDX_BIT(SYSCFG_CFG3_REG_OFFSET, 17U),     /*!< SRAM0 ECC error address */
    SYSCFG_SRAM1_ERR_ADDR         = SYSCFG_REGIDX_BIT(SYSCFG_CFG4_REG_OFFSET, 20U),     /*!< SRAM1 ECC error address */
    SYSCFG_TCMSRAM_ERR_ADDR       = SYSCFG_REGIDX_BIT(SYSCFG_CFG5_REG_OFFSET, 19U)      /*!< TCMSRAM ECC error address */
}syscfg_sram_erraddr_enum;

/* TCMSRAM write protection unlock key */
#define WP_UNLOCK_KEY0                      ((uint8_t)0xCAU)                            /*!< unlock key 0 */
#define WP_UNLOCK_KEY1                      ((uint8_t)0x53U)                            /*!< unlock key 1 */
#define WP_LOCK_KEY                         ((uint8_t)0xAAU)                            /*!< lock key */

/* I/O compensation cell enable/disable */
#define SYSCFG_IO_COMPENSATION_ENABLE       ((uint32_t)0x00000001U)                     /*!< I/O compensation cell enable */
#define SYSCFG_IO_COMPENSATION_DISABLE      ((uint32_t)0x00000000U)                     /*!< I/O compensation cell disable */

/* module lockup */
#define SYSCFG_LOCKUP_LOCKUP                SYSCFG_CFG2_LOCKUP_LOCK                     /*!< CPU lockup signal connected  */
#define SYSCFG_SRAM0_LOCKUP                 SYSCFG_CFG2_SRAM0_ECC_LOCK                  /*!< SRAM0 ECC double error signal connected */
#define SYSCFG_LVD_LOCKUP                   SYSCFG_CFG2_LVD_LOCK                        /*!< LVD signal connected */
#define SYSCFG_FLASH_LOCKUP                 SYSCFG_CFG2_FLASH_ECC_LOCK                  /*!< Flash ECC double error signal connected */
#define SYSCFG_SRAM1_LOCKUP                 SYSCFG_CFG2_SRAM1_ECC_LOCK                  /*!< SRAM1 ECC double error signal connected */
#define SYSCFG_TCMSRAM_LOCKUP               SYSCFG_CFG2_TCMSRAM_ECC_LOCK                /*!< TCMSRAM ECC double error signal connected */

/* TCMSRAM page x write protection*/
#define SYSCFG_TCMSRAM_WP_PAGE0             SYSCFG_TCMSRAMWP_P0WPEN                     /*!< TCMSRAM page 0 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE1             SYSCFG_TCMSRAMWP_P1WPEN                     /*!< TCMSRAM page 1 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE2             SYSCFG_TCMSRAMWP_P2WPEN                     /*!< TCMSRAM page 2 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE3             SYSCFG_TCMSRAMWP_P3WPEN                     /*!< TCMSRAM page 3 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE4             SYSCFG_TCMSRAMWP_P4WPEN                     /*!< TCMSRAM page 4 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE5             SYSCFG_TCMSRAMWP_P5WPEN                     /*!< TCMSRAM page 5 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE6             SYSCFG_TCMSRAMWP_P6WPEN                     /*!< TCMSRAM page 6 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE7             SYSCFG_TCMSRAMWP_P7WPEN                     /*!< TCMSRAM page 7 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE8             SYSCFG_TCMSRAMWP_P8WPEN                     /*!< TCMSRAM page 8 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE9             SYSCFG_TCMSRAMWP_P9WPEN                     /*!< TCMSRAM page 9 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE10            SYSCFG_TCMSRAMWP_P10WPEN                    /*!< TCMSRAM page 10 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE11            SYSCFG_TCMSRAMWP_P11WPEN                    /*!< TCMSRAM page 11 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE12            SYSCFG_TCMSRAMWP_P12WPEN                    /*!< TCMSRAM page 12 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE13            SYSCFG_TCMSRAMWP_P13WPEN                    /*!< TCMSRAM page 13 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE14            SYSCFG_TCMSRAMWP_P14WPEN                    /*!< TCMSRAM page 14 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE15            SYSCFG_TCMSRAMWP_P15WPEN                    /*!< TCMSRAM page 15 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE16            SYSCFG_TCMSRAMWP_P16WPEN                    /*!< TCMSRAM page 16 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE17            SYSCFG_TCMSRAMWP_P17WPEN                    /*!< TCMSRAM page 17 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE18            SYSCFG_TCMSRAMWP_P18WPEN                    /*!< TCMSRAM page 18 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE19            SYSCFG_TCMSRAMWP_P19WPEN                    /*!< TCMSRAM page 19 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE20            SYSCFG_TCMSRAMWP_P20WPEN                    /*!< TCMSRAM page 20 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE21            SYSCFG_TCMSRAMWP_P21WPEN                    /*!< TCMSRAM page 21 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE22            SYSCFG_TCMSRAMWP_P22WPEN                    /*!< TCMSRAM page 22 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE23            SYSCFG_TCMSRAMWP_P23WPEN                    /*!< TCMSRAM page 23 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE24            SYSCFG_TCMSRAMWP_P24WPEN                    /*!< TCMSRAM page 24 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE25            SYSCFG_TCMSRAMWP_P25WPEN                    /*!< TCMSRAM page 25 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE26            SYSCFG_TCMSRAMWP_P26WPEN                    /*!< TCMSRAM page 26 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE27            SYSCFG_TCMSRAMWP_P27WPEN                    /*!< TCMSRAM page 27 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE28            SYSCFG_TCMSRAMWP_P28WPEN                    /*!< TCMSRAM page 28 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE29            SYSCFG_TCMSRAMWP_P29WPEN                    /*!< TCMSRAM page 29 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE30            SYSCFG_TCMSRAMWP_P30WPEN                    /*!< TCMSRAM page 30 write protection enable */
#define SYSCFG_TCMSRAM_WP_PAGE31            SYSCFG_TCMSRAMWP_P31WPEN                    /*!< TCMSRAM page 31 write protection enable */

/* TIMER input select mask bits definition */
#define TIMER_IS_MASK                       BITS(0,3)                                   /*!< TIMER source select mask */

/* TIMER input select definitions */
#define TIMERCISEL0                         ((uint8_t)0x00U)                            /*!< TIMER input select register 0 */
#define TIMERCISEL1                         ((uint8_t)0x01U)                            /*!< TIMER input select register 1 */
#define TIMERCISEL2                         ((uint8_t)0x02U)                            /*!< TIMER input select register 2 */
#define TIMERCISEL3                         ((uint8_t)0x03U)                            /*!< TIMER input select register 3 */
#define TIMERCISEL4                         ((uint8_t)0x04U)                            /*!< TIMER input select register 4 */

