wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_syscfg.h
/* define the TIMER bit position and its register index offset */
#define TIMER_REGIDX_BIT(regidx, bitpos, value)   (((uint32_t)(regidx) << 24U) | (uint32_t)((bitpos) << 16U)\
        | ((uint32_t)(value)))
#define TIMER_REG_INDEX(val)                (((uint32_t)(val) & 0xFF000000U) >> 24U)
#define TIMER_BIT_POS(val)                  (((uint32_t)(val) & 0x00FF0000U) >> 16U)
#define TIMER_SEL_VAL(val)                  ((uint32_t)(val) & 0x000000FFU)

/* TIMERx channel input Select definitions */
typedef enum {
    TIMER7_CI0_INPUT_TIMER7_CH0         = TIMER_REGIDX_BIT(TIMERCISEL0, 0U, 0U),        /*!< select TIMER7 CH0 as TIMER7 CI0 */
    TIMER7_CI0_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 0U, 1U),        /*!< select CMP0 output as TIMER7 CI0 */
    TIMER7_CI0_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 0U, 2U),        /*!< select CMP1 output as TIMER7 CI0 */
    TIMER7_CI0_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 0U, 3U),        /*!< select CMP2 output as TIMER7 CI0 */
    TIMER7_CI0_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 0U, 4U),        /*!< select CMP3 output as TIMER7 CI0 */
    TIMER7_CI0_INPUT_CLA0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 0U, 5U),        /*!< select CLA0 output as TIMER7 CI0 */
    TIMER7_CI1_INPUT_TIMER7_CH1         = TIMER_REGIDX_BIT(TIMERCISEL0, 4U, 0U),        /*!< select TIMER7 CH1 as TIMER7 CI1 */
    TIMER7_CI1_INPUT_CLA1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 4U, 1U),        /*!< select CLA1 output as TIMER7 CI1 */
    TIMER7_CI2_INPUT_TIMER7_CH2         = TIMER_REGIDX_BIT(TIMERCISEL0, 8U, 0U),        /*!< select TIMER7 CH2 as TIMER7 CI2 */
    TIMER7_CI2_INPUT_CLA2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 8U, 1U),        /*!< select CLA2 output as TIMER7 CI2 */
    TIMER7_CI3_INPUT_TIMER7_CH3         = TIMER_REGIDX_BIT(TIMERCISEL0, 12U, 0U),       /*!< select TIMER7 CH3 as TIMER7 CI3 */
    TIMER7_CI3_INPUT_CLA3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 12U, 1U),       /*!< select CLA3 output as TIMER7 CI3 */
    TIMER0_CI0_INPUT_TIMER0_CH0         = TIMER_REGIDX_BIT(TIMERCISEL0, 16U, 0U),       /*!< select TIMER0 CH0 as TIMER0 CI0 */
    TIMER0_CI0_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 16U, 1U),       /*!< select CMP0 output as TIMER0 CI0 */
    TIMER0_CI0_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 16U, 2U),       /*!< select CMP1 output as TIMER0 CI0 */
    TIMER0_CI0_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 16U, 3U),       /*!< select CMP2 output as TIMER0 CI0 */
    TIMER0_CI0_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 16U, 4U),       /*!< select CMP3 output as TIMER0 CI0 */
    TIMER0_CI0_INPUT_CLA0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 16U, 5U),       /*!< select CLA0 output as TIMER0 CI0 */
    TIMER0_CI1_INPUT_TIMER0_CH1         = TIMER_REGIDX_BIT(TIMERCISEL0, 20U, 0U),       /*!< select TIMER0 CH1 as TIMER0 CI1 */
    TIMER0_CI1_INPUT_CLA1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 20U, 1U),       /*!< select CLA1 output as TIMER0 CI1 */
    TIMER0_CI2_INPUT_TIMER0_CH2         = TIMER_REGIDX_BIT(TIMERCISEL0, 24U, 0U),       /*!< select TIMER0 CH2 as TIMER0 CI2 */
    TIMER0_CI2_INPUT_CLA2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 24U, 1U),       /*!< select CLA2 output as TIMER0 CI2 */
    TIMER0_CI3_INPUT_TIMER0_CH3         = TIMER_REGIDX_BIT(TIMERCISEL0, 28U, 0U),       /*!< select TIMER0 CH3 as TIMER0 CI3 */
    TIMER0_CI3_INPUT_CLA3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL0, 28U, 1U),       /*!< select CLA3 output as TIMER0 CI3 */
    TIMER19_CI0_INPUT_TIMER19_CH0        = TIMER_REGIDX_BIT(TIMERCISEL1, 0U, 0U),       /*!< select TIMER19 CH0 as TIMER19 CI0 */
    TIMER19_CI0_INPUT_CMP0_OUT          = TIMER_REGIDX_BIT(TIMERCISEL1, 0U, 1U),        /*!< select CMP0 output as TIMER19 CI0 */
    TIMER19_CI0_INPUT_CMP1_OUT          = TIMER_REGIDX_BIT(TIMERCISEL1, 0U, 2U),        /*!< select CMP1 output as TIMER19 CI0 */
    TIMER19_CI0_INPUT_CMP2_OUT          = TIMER_REGIDX_BIT(TIMERCISEL1, 0U, 3U),        /*!< select CMP2 output as TIMER19 CI0 */
    TIMER19_CI0_INPUT_CMP3_OUT          = TIMER_REGIDX_BIT(TIMERCISEL1, 0U, 4U),        /*!< select CMP3 output as TIMER19 CI0 */
    TIMER19_CI0_INPUT_CLA0_OUT          = TIMER_REGIDX_BIT(TIMERCISEL1, 0U, 5U),        /*!< select CLA0 output as TIMER19 CI0 */
    TIMER19_CI1_INPUT_TIMER19_CH1        = TIMER_REGIDX_BIT(TIMERCISEL1, 4U, 0U),       /*!< select TIMER19 CH1 as TIMER19 CI1 */
    TIMER19_CI1_INPUT_CLA1_OUT          = TIMER_REGIDX_BIT(TIMERCISEL1, 4U, 1U),        /*!< select CLA1 output as TIMER19 CI1 */
    TIMER19_CI2_INPUT_TIMER19_CH2        = TIMER_REGIDX_BIT(TIMERCISEL1, 8U, 0U),       /*!< select TIMER19 CH2 as TIMER19 CI2 */
    TIMER19_CI2_INPUT_CLA2_OUT          = TIMER_REGIDX_BIT(TIMERCISEL1, 8U, 1U),        /*!< select CLA2 output as TIMER19 CI2 */
    TIMER19_CI3_INPUT_TIMER19_CH3        = TIMER_REGIDX_BIT(TIMERCISEL1, 12U, 0U),      /*!< select TIMER19 CH3 as TIMER19 CI3 */
    TIMER19_CI3_INPUT_CLA3_OUT          = TIMER_REGIDX_BIT(TIMERCISEL1, 12U, 1U),       /*!< select CLA3 output as TIMER19 CI3 */
    TIMER2_CI0_INPUT_TIMER2_CH0         = TIMER_REGIDX_BIT(TIMERCISEL2, 0U, 0U),        /*!< select TIMER2 CH0 as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 0U, 1U),        /*!< select CMP0 output as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 0U, 2U),        /*!< select CMP1 output as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 0U, 3U),        /*!< select CMP2 output as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 0U, 4U),        /*!< select CMP3 output as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CMP4_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 0U, 5U),        /*!< select CMP4 output as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CMP5_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 0U, 6U),        /*!< select CMP5 output as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CMP6_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 0U, 7U),        /*!< select CMP6 output as TIMER2 CI0 */
    TIMER2_CI0_INPUT_CLA0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 0U, 8U),        /*!< select CLA0 output as TIMER2 CI0 */
    TIMER2_CI1_INPUT_TIMER2_CH1         = TIMER_REGIDX_BIT(TIMERCISEL2, 4U, 0U),        /*!< select TIMER2 CH1 as TIMER2 CI1 */
    TIMER2_CI1_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 4U, 1U),        /*!< select CMP0 output as TIMER2 CI1 */
    TIMER2_CI1_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 4U, 2U),        /*!< select CMP1 output as TIMER2 CI1 */
    TIMER2_CI1_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 4U, 3U),        /*!< select CMP2 output as TIMER2 CI1 */
    TIMER2_CI1_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 4U, 4U),        /*!< select CMP3 output as TIMER2 CI1 */
    TIMER2_CI1_INPUT_CMP4_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 4U, 5U),        /*!< select CMP4 output as TIMER2 CI1 */
    TIMER2_CI1_INPUT_CMP5_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 4U, 6U),        /*!< select CMP5 output as TIMER2 CI1 */
    TIMER2_CI1_INPUT_CMP6_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 4U, 7U),        /*!< select CMP6 output as TIMER2 CI1 */
    TIMER2_CI1_INPUT_CLA1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 4U, 8U),        /*!< select CLA1 output as TIMER2 CI1 */
    TIMER2_CI2_INPUT_TIMER2_CH2         = TIMER_REGIDX_BIT(TIMERCISEL2, 8U, 0U),        /*!< select TIMER2 CH2 as TIMER2 CI2 */
    TIMER2_CI2_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 8U, 1U),        /*!< select CMP2 output as TIMER2 CI2 */
    TIMER2_CI2_INPUT_CLA2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 8U, 2U),        /*!< select CLA2 output as TIMER2 CI2 */
    TIMER2_CI3_INPUT_TIMER2_CH3         = TIMER_REGIDX_BIT(TIMERCISEL2, 12U, 0U),       /*!< select TIMER2 CH3 as TIMER2 CI3 */
    TIMER2_CI3_INPUT_CLA3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 12U, 1U),       /*!< select CLA3 output as TIMER2 CI3 */
    TIMER1_CI0_INPUT_TIMER1_CH0         = TIMER_REGIDX_BIT(TIMERCISEL2, 16U, 0U),       /*!< select TIMER1 CH0 as TIMER1 CI0 */
    TIMER1_CI0_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 16U, 1U),       /*!< select CMP0 output as TIMER1 CI0 */
    TIMER1_CI0_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 16U, 2U),       /*!< select CMP1 output as TIMER1 CI0 */
    TIMER1_CI0_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 16U, 3U),       /*!< select CMP2 output as TIMER1 CI0 */
    TIMER1_CI0_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 16U, 4U),       /*!< select CMP3 output as TIMER1 CI0 */
    TIMER1_CI0_INPUT_CMP4_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 16U, 5U),       /*!< select CMP4 output as TIMER1 CI0 */
    TIMER1_CI0_INPUT_CLA0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 16U, 6U),       /*!< select CLA0 output as TIMER1 CI0 */
    TIMER1_CI1_INPUT_TIMER1_CH1         = TIMER_REGIDX_BIT(TIMERCISEL2, 20U, 0U),       /*!< select TIMER1 CH1 as TIMER1 CI1 */
    TIMER1_CI1_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 20U, 1U),       /*!< select CMP0 output as TIMER1 CI1 */
    TIMER1_CI1_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 20U, 2U),       /*!< select CMP1 output as TIMER1 CI1 */
    TIMER1_CI1_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 20U, 3U),       /*!< select CMP2 output as TIMER1 CI1 */
    TIMER1_CI1_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 20U, 4U),       /*!< select CMP3 output as TIMER1 CI1 */
    TIMER1_CI1_INPUT_CMP5_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 20U, 5U),       /*!< select CMP5 output as TIMER1 CI1 */
    TIMER1_CI1_INPUT_CLA1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 20U, 6U),       /*!< select CLA1 output as TIMER1 CI1 */
    TIMER1_CI2_INPUT_TIMER1_CH2         = TIMER_REGIDX_BIT(TIMERCISEL2, 24U, 0U),       /*!< select TIMER1 CH2 as TIMER1 CI2 */
    TIMER1_CI2_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 24U, 1U),       /*!< select CMP3 output as TIMER1 CI2 */
    TIMER1_CI2_INPUT_CLA2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 24U, 2U),       /*!< select CLA2 output as TIMER1 CI2 */
    TIMER1_CI3_INPUT_TIMER1_CH3         = TIMER_REGIDX_BIT(TIMERCISEL2, 28U, 0U),       /*!< select TIMER1 CH3 as TIMER1 CI3 */
    TIMER1_CI3_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 28U, 1U),       /*!< select CMP0 output as TIMER1 CI3 */
    TIMER1_CI3_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 28U, 2U),       /*!< select CMP1 output as TIMER1 CI3 */
    TIMER1_CI3_INPUT_CLA3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL2, 28U, 3U),       /*!< select CLA3 output as TIMER1 CI3 */
    TIMER4_CI0_INPUT_TIMER4_CH0         = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 0U),        /*!< select TIMER4 CH0 as TIMER4 CI0 */
    TIMER4_CI0_INPUT_IRC32K             = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 1U),        /*!< select IRC32K output as TIMER4 CI0 */
    TIMER4_CI0_INPUT_LXTAL              = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 2U),        /*!< select LXTAL output as TIMER4 CI0 */
    TIMER4_CI0_INPUT_RTC_WAKEUP         = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 3U),        /*!< select RTC_WAKEUP output as TIMER4 CI0 */
    TIMER4_CI0_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 4U),        /*!< select CMP0 output as TIMER4 CI0 */
    TIMER4_CI0_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 5U),        /*!< select CMP1 output as TIMER4 CI0 */
    TIMER4_CI0_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 6U),        /*!< select CMP2 output as TIMER4 CI0 */
    TIMER4_CI0_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 7U),        /*!< select CMP3 output as TIMER4 CI0 */
    TIMER4_CI0_INPUT_CMP4_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 8U),        /*!< select CMP4 output as TIMER4 CI0 */
    TIMER4_CI0_INPUT_CMP5_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 9U),        /*!< select CMP5 output as TIMER4 CI0 */
    TIMER4_CI0_INPUT_CMP6_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 10U),       /*!< select CMP6 output as TIMER4 CI0 */
    TIMER4_CI0_INPUT_CLA0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 0U, 11U),       /*!< select CLA0 output as TIMER4 CI0 */
    TIMER4_CI1_INPUT_TIMER4_CH1         = TIMER_REGIDX_BIT(TIMERCISEL3, 4U, 0U),        /*!< select TIMER4 CH1 as TIMER4 CI1 */
    TIMER4_CI1_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 4U, 1U),        /*!< select CMP0 output as TIMER4 CI1 */
    TIMER4_CI1_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 4U, 2U),        /*!< select CMP1 output as TIMER4 CI1 */
    TIMER4_CI1_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 4U, 3U),        /*!< select CMP2 output as TIMER4 CI1 */
    TIMER4_CI1_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 4U, 4U),        /*!< select CMP3 output as TIMER4 CI1 */
    TIMER4_CI1_INPUT_CMP4_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 4U, 5U),        /*!< select CMP4 output as TIMER4 CI1 */
    TIMER4_CI1_INPUT_CMP5_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 4U, 6U),        /*!< select CMP5 output as TIMER4 CI1 */
    TIMER4_CI1_INPUT_CMP6_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 4U, 7U),        /*!< select CMP6 output as TIMER4 CI1 */
    TIMER4_CI1_INPUT_CLA1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 4U, 8U),        /*!< select CLA1 output as TIMER4 CI1 */
    TIMER4_CI2_INPUT_TIMER4_CH2         = TIMER_REGIDX_BIT(TIMERCISEL3, 8U, 0U),        /*!< select TIMER4 CH2 as TIMER4 CI2 */
    TIMER4_CI2_INPUT_CLA2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 8U, 1U),        /*!< select CLA2 output as TIMER4 CI2 */
    TIMER4_CI3_INPUT_TIMER4_CH3         = TIMER_REGIDX_BIT(TIMERCISEL3, 12U, 0U),       /*!< select TIMER4 CH3 as TIMER4 CI3 */
    TIMER4_CI3_INPUT_CLA3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 12U, 1U),       /*!< select CLA3 output as TIMER4 CI3 */
    TIMER3_CI0_INPUT_TIMER3_CH0         = TIMER_REGIDX_BIT(TIMERCISEL3, 16U, 0U),       /*!< select TIMER3 CH0 as TIMER3 CI0 */
    TIMER3_CI0_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 16U, 1U),       /*!< select CMP0 output as TIMER3 CI0 */
    TIMER3_CI0_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 16U, 2U),       /*!< select CMP1 output as TIMER3 CI0 */
    TIMER3_CI0_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 16U, 3U),       /*!< select CMP2 output as TIMER3 CI0 */
    TIMER3_CI0_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 16U, 4U),       /*!< select CMP3 output as TIMER3 CI0 */
    TIMER3_CI0_INPUT_CMP4_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 16U, 5U),       /*!< select CMP4 output as TIMER3 CI0 */
    TIMER3_CI0_INPUT_CMP5_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 16U, 6U),       /*!< select CMP5 output as TIMER3 CI0 */
    TIMER3_CI0_INPUT_CMP6_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 16U, 7U),       /*!< select CMP6 output as TIMER3 CI0 */
    TIMER3_CI0_INPUT_CLA0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 16U, 8U),       /*!< select CLA0 output as TIMER3 CI0 */
    TIMER3_CI1_INPUT_TIMER3_CH1         = TIMER_REGIDX_BIT(TIMERCISEL3, 20U, 0U),       /*!< select TIMER3 CH1 as TIMER3 CI1 */
    TIMER3_CI1_INPUT_CMP0_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 20U, 1U),       /*!< select CMP0 output as TIMER3 CI1 */
    TIMER3_CI1_INPUT_CMP1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 20U, 2U),       /*!< select CMP1 output as TIMER3 CI1 */
    TIMER3_CI1_INPUT_CMP2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 20U, 3U),       /*!< select CMP2 output as TIMER3 CI1 */
    TIMER3_CI1_INPUT_CMP3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 20U, 4U),       /*!< select CMP3 output as TIMER3 CI1 */
    TIMER3_CI1_INPUT_CMP4_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 20U, 5U),       /*!< select CMP4 output as TIMER3 CI1 */
    TIMER3_CI1_INPUT_CMP5_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 20U, 6U),       /*!< select CMP5 output as TIMER3 CI1 */
    TIMER3_CI1_INPUT_CMP6_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 20U, 7U),       /*!< select CMP6 output as TIMER3 CI1 */
    TIMER3_CI1_INPUT_CLA1_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 20U, 8U),       /*!< select CLA1 output as TIMER3 CI1 */
    TIMER3_CI2_INPUT_TIMER3_CH2         = TIMER_REGIDX_BIT(TIMERCISEL3, 24U, 0U),       /*!< select TIMER3 CH2 as TIMER3 CI2 */
    TIMER3_CI2_INPUT_CMP4_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 24U, 1U),       /*!< select CMP4 output as TIMER3 CI1 */
    TIMER3_CI2_INPUT_CLA2_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 24U, 2U),       /*!< select CLA2 output as TIMER3 CI2 */
    TIMER3_CI3_INPUT_TIMER3_CH3         = TIMER_REGIDX_BIT(TIMERCISEL3, 28U, 0U),       /*!< select TIMER3 CH3 as TIMER3 CI3 */
    TIMER3_CI3_INPUT_CMP5_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 28U, 1U),       /*!< select CMP5 output as TIMER3 CI3 */
    TIMER3_CI3_INPUT_CLA3_OUT           = TIMER_REGIDX_BIT(TIMERCISEL3, 28U, 2U),       /*!< select CLA3 output as TIMER3 CI3 */
    TIMER14_CI0_INPUT_TIMER14_CH0       = TIMER_REGIDX_BIT(TIMERCISEL4, 0U, 0U),        /*!< select TIMER14 CH0 as TIMER14 CI0 */
    TIMER14_CI0_INPUT_LXTAL             = TIMER_REGIDX_BIT(TIMERCISEL4, 0U, 1U),        /*!< select LXTAL as TIMER14 CI0 */
    TIMER14_CI0_INPUT_CMP0_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 0U, 2U),        /*!< select CMP0 output as TIMER14 CI0 */
    TIMER14_CI0_INPUT_CMP1_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 0U, 3U),        /*!< select CMP1 output as TIMER14 CI0 */
    TIMER14_CI0_INPUT_CMP4_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 0U, 4U),        /*!< select CMP4 output as TIMER14 CI0 */
    TIMER14_CI0_INPUT_CMP6_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 0U, 5U),        /*!< select CMP6 output as TIMER14 CI0 */
    TIMER14_CI0_INPUT_CLA0_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 0U, 6U),        /*!< select CLA0 output as TIMER14 CI0 */
    TIMER14_CI0_INPUT_CLA1_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 0U, 7U),        /*!< select CLA1 output as TIMER14 CI0 */
    TIMER14_CI0_INPUT_CLA2_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 0U, 8U),        /*!< select CLA2 output as TIMER14 CI0 */
    TIMER14_CI0_INPUT_CLA3_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 0U, 9U),        /*!< select CLA3 output as TIMER14 CI0 */
    TIMER14_CI1_INPUT_TIMER31_CH1       = TIMER_REGIDX_BIT(TIMERCISEL4, 4U, 0U),        /*!< select TIMER14 CH1 as TIMER14 CI1 */
    TIMER14_CI1_INPUT_CMP1_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 4U, 1U),        /*!< select CMP1 output as TIMER14 CI1 */
    TIMER14_CI1_INPUT_CMP2_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 4U, 2U),        /*!< select CMP2 output as TIMER14 CI1 */
    TIMER14_CI1_INPUT_CMP5_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 4U, 3U),        /*!< select CMP5 output as TIMER14 CI1 */
    TIMER14_CI1_INPUT_CMP6_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 4U, 4U),        /*!< select CMP6 output as TIMER14 CI1 */
    TIMER15_CI0_INPUT_TIMER15_CH0       = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 0U),        /*!< select TIMER15 CH0 as TIMER15 CI0 */
    TIMER15_CI0_INPUT_CMP5_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 1U),        /*!< select CMP5 output as TIMER15 CI0 */
    TIMER15_CI0_INPUT_CKOUT             = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 2U),        /*!< select CKOUT as TIMER15 CI0 */
    TIMER15_CI0_INPUT_HXTAL_DIV32       = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 3U),        /*!< select HXTAL/32 as TIMER15 CI0 */
    TIMER15_CI0_INPUT_RTC_CLOCK         = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 4U),        /*!< select RTC Clock as TIMER15 CI0 */
    TIMER15_CI0_INPUT_LXTAL             = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 5U),        /*!< select LXATL as TIMER15 CI0 */
    TIMER15_CI0_INPUT_IRC32K            = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 6U),        /*!< select IARC32K as TIMER15 CI0 */
    TIMER15_CI0_INPUT_CLA0_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 7U),        /*!< select CLA0 output as TIMER15 CI0 */
    TIMER15_CI0_INPUT_CLA1_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 8U),        /*!< select CLA1 output as TIMER15 CI0 */
    TIMER15_CI0_INPUT_CLA2_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 9U),        /*!< select CLA2 output as TIMER15 CI0 */
    TIMER15_CI0_INPUT_CLA3_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 10U),       /*!< select CLA3 output as TIMER15 CI0 */
    TIMER15_CI0_INPUT_HXTAL             = TIMER_REGIDX_BIT(TIMERCISEL4, 8U, 11U),       /*!< select HXTAL as TIMER15 CI0 */
    TIMER16_CI0_INPUT_TIMER16_CH0       = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 0U),       /*!< select TIMER16 CH0 as TIMER16 CI0 */
    TIMER16_CI0_INPUT_CMP4_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 1U),       /*!< select CMP5 output as TIMER16 CI0 */
    TIMER16_CI0_INPUT_CKOUT             = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 2U),       /*!< select clock output as TIMER16 CI0 */
    TIMER16_CI0_INPUT_HXTAL_DIV32       = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 3U),       /*!< select HXTAL/32 as TIMER16 CI0 */
    TIMER16_CI0_INPUT_RTC_CLOCK         = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 4U),       /*!< select RTC Clock as TIMER16 CI0 */
    TIMER16_CI0_INPUT_LXTAL             = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 5U),       /*!< select LXTAL as TIMER16 CI0 */
    TIMER16_CI0_INPUT_IRC32K            = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 6U),       /*!< select IRC32K as TIMER16 CI0 */
    TIMER16_CI0_INPUT_CLA0_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 7U),       /*!< select CLA0 output as TIMER16 CI0 */
    TIMER16_CI0_INPUT_CLA1_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 8U),       /*!< select CLA1 output as TIMER16 CI0 */
    TIMER16_CI0_INPUT_CLA2_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 9U),       /*!< select CLA2 output as TIMER16 CI0 */
    TIMER16_CI0_INPUT_CLA3_OUT          = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 10U),      /*!< select CLA3 output as TIMER16 CI0 */
    TIMER16_CI0_INPUT_HXTAL             = TIMER_REGIDX_BIT(TIMERCISEL4, 12U, 11U)       /*!< select HXTAL as TIMER16 CI0 */
} timer_channel_input_enum;

