wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_syscfg.h
/* Memory functions */
/* switch flash Bank0 and Bank1 address */
void syscfg_flash_bank_remap_set(uint32_t value);
/* select bootmode memory mapping */
void syscfg_bootmode_memmap_select(uint32_t mem_select);
/* get SRAM ECC single correctable bit */
uint32_t syscfg_sram_ecc_single_correctable_bit_get(syscfg_sram_serrbits_enum sram);
/* get SRAM ECC error address */
uint32_t syscfg_sram_ecc_error_address_get(syscfg_sram_erraddr_enum sram);
/* erase tcmsram */
void syscfg_tcmsram_erase(void);
/* lock the TCMSRAM erase */
void syscfg_tcmsram_erase_lock(void);
/* unlock the TCMSRAM erase */
void syscfg_tcmsram_erase_unlock(void);
/* enable TCMSRAM page x write protection */
void syscfg_tcmsram_page_wp_enable(uint32_t pagex);

/* I/O compensation cell functions */
/* configure the I/O compensation cell */
void syscfg_io_compensation_config(uint32_t syscfg_cps);

/* flag and interrupt functions */
/* enable FPU interrupt */
void syscfg_fpu_interrupt_enable(uint32_t interrupt);
/* disable FPU interrupt */
void syscfg_fpu_interrupt_disable(uint32_t interrupt);
/* get the interrupt flags */
FlagStatus syscfg_interrupt_flag_get(syscfg_flag_enum int_flag);
/* clear the interrupt flags */
void syscfg_interrupt_flag_clear(syscfg_flag_enum int_flag);
/* enable the syscfg peripherals interrupt */
void syscfg_interrupt_enable(syscfg_interrupt_enum interrupt);
/* disable the syscfg peripherals interrupt */
void syscfg_interrupt_disable(syscfg_interrupt_enum interrupt);
/* get tcmsram erase busy flag */
FlagStatus syscfg_tcmsram_busy_flag_get(void);
/* get compensation cell ready flag */
FlagStatus syscfg_compensation_cell_ready_flag_get(void);
#endif /* GD32G5X3_SYSCFG_H */
